In [1]:
import pandas as pd # pd is the alias name here

How to create a series object from a list

In [2]:
my_list = ['a','b','c','d','e']

print(type(my_list))

<class 'list'>

In [3]:
first_series = pd.Series(my_list)

In [4]:
print(first_series)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [5]:
labels = ["Vaishali", "Sandeep", "Vignesh", "Srimuki"]

emp_id_list = [101,102,103,104]

emp_series = pd.Series(data = emp_id_list)

In [6]:
emp_series

0    101
1    102
2    103
3    104
dtype: int64

In [7]:
emp_series_with_label = pd.Series(data = emp_id_list , index = labels)

emp_series_with_label

Vaishali    101
Sandeep     102
Vignesh     103
Srimuki     104
dtype: int64

In [8]:
# how to create series from a numpy array?
import numpy as np

num_array = np.array([1,2,3,4,5,6])

In [10]:
num_series = pd.Series(num_array)

print(num_series)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int32

How to create series from a dictionary

In [11]:
dict_fruit_quant = {"Bananas": 100, "Avacados": 50 , "Mangoes" : 200}

series_fruit_quant = pd.Series(dict_fruit_quant)
series_fruit_quant

Bananas     100
Avacados     50
Mangoes     200
dtype: int64

In [13]:
print("The number of dimensions in a series object is :")
series_fruit_quant.ndim

The number of dimensions in a series object is :

1

In [14]:
series_fruit_quant[0] #using the index

100

In [15]:
series_fruit_quant["Bananas"]

100

How to select values in Series objects? 

-- iloc - index location -- uses indices

-- loc  - location -- uses labels

In [16]:
series_fruit_quant

Bananas     100
Avacados     50
Mangoes     200
dtype: int64

In [17]:
series_fruit_quant.iloc[1] # only square braces to be used

50

In [18]:
series_fruit_quant.loc[1] # 1 is not a label in series_fruit_quant variable, hence we are getting an error

TypeError: cannot do label indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [1] of <class 'int'>

In [19]:
series_fruit_quant.loc["Mangoes"]

200

In [20]:
first_series

0    a
1    b
2    c
3    d
4    e
dtype: object

In [21]:
first_series.loc[2] # here , it doesn't throw an error because 2 is a label in first_series variable

'c'

In [22]:
first_series.loc[4]

'e'

In [26]:
first_series.iloc[4]

'e'

Vectorising operation in Series

In [29]:
first_series = pd.Series([1,2,3,4], index = ['a','b','c','d'])
second_series = pd.Series([10,20,30,40], index =['a','b','c','d'])

first_series + second_series

a    11
b    22
c    33
d    44
dtype: int64

In [30]:
first_series = pd.Series([1,2,3,4], index = ['a','b','c','d'])
second_series2 = pd.Series([10,20,30,40], index =['a','c','b','d'])

first_series + second_series2

a    11
b    32
c    23
d    44
dtype: int64

In [31]:
first_series = pd.Series([1,2,3,4], index = ['a','b','c','d'])
second_series3 = pd.Series([10,20,30,40], index =['a','c','e','f'])

first_series + second_series3

a    11.0
b     NaN
c    23.0
d     NaN
e     NaN
f     NaN
dtype: float64

# Dataframes in Pandas

In [32]:
olympic_data_list = {"HostCity" : ["Tokyo","London","Beijing","Athens","Sydney","Atlanta"],
                    "Year":[2021,2012,2008,2004,2000,1996],
                    "No. Of Participating Countries":[202,205,204,201,200,197]}
print(olympic_data_list)

{'HostCity': ['Tokyo', 'London', 'Beijing', 'Athens', 'Sydney', 'Atlanta'], 'Year': [2021, 2012, 2008, 2004, 2000, 1996], 'No. Of Participating Countries': [202, 205, 204, 201, 200, 197]}

How to create a dataframe from a dictionary?

In [34]:
olympic_df = pd.DataFrame(olympic_data_list)

In [35]:
olympic_df  # below is just a view of a dataframe

  HostCity  Year  No. Of Participating Countries
0    Tokyo  2021                             202
1   London  2012                             205
2  Beijing  2008                             204
3   Athens  2004                             201
4   Sydney  2000                             200
5  Atlanta  1996                             197

the 2 dimensional labelled datastructure of pandas is called a dataframe. every column in a dataframe is a series object

In [36]:
 print(type(olympic_df))

<class 'pandas.core.frame.DataFrame'>

In [37]:
olympic_df["Year"]

0    2021
1    2012
2    2008
3    2004
4    2000
5    1996
Name: Year, dtype: int64

In [38]:
print(type(olympic_df["Year"]))

<class 'pandas.core.series.Series'>

How to select values that are present in a dataframe ?

In [39]:
olympic_df["Year"]

0    2021
1    2012
2    2008
3    2004
4    2000
5    1996
Name: Year, dtype: int64

In [40]:
olympic_df.Year # mind that you give the column name as it is, because this is case sensitive

0    2021
1    2012
2    2008
3    2004
4    2000
5    1996
Name: Year, dtype: int64

In [41]:
cols_list = ["Year" ,"HostCity" ]

olympic_df[cols_list]

   Year HostCity
0  2021    Tokyo
1  2012   London
2  2008  Beijing
3  2004   Athens
4  2000   Sydney
5  1996  Atlanta

In [42]:
olympic_df[["Year" ,"HostCity" ]]

   Year HostCity
0  2021    Tokyo
1  2012   London
2  2008  Beijing
3  2004   Athens
4  2000   Sydney
5  1996  Atlanta

use of loc & iloc in a dataframe

In [43]:
olympic_df

  HostCity  Year  No. Of Participating Countries
0    Tokyo  2021                             202
1   London  2012                             205
2  Beijing  2008                             204
3   Athens  2004                             201
4   Sydney  2000                             200
5  Atlanta  1996                             197

In [44]:
olympic_df.iloc[0:2, 0:2] # the first value represents the rows
# the second value represents the columns

# and the start and stop indexing concept applies here (i.e) start value is always inclusive &
# the stop value is exclusive

  HostCity  Year
0    Tokyo  2021
1   London  2012

In [49]:
olympic_df.iloc[0::2, 0:2]

  HostCity  Year
0    Tokyo  2021
2  Beijing  2008
4   Sydney  2000

In [45]:
olympic_df.loc[0:2, 0:2] # this throws an error because 0:2 is not a valid column label

TypeError: cannot do slice indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [0] of <class 'int'>

In [48]:
olympic_df.loc[[0,1], ["HostCity","Year"]]

  HostCity  Year
0    Tokyo  2021
1   London  2012

# Attributes of Dataframe

<ul>
<li>dtypes</li>
<li>columns</li>
<li>shape</li>
<li>axes</li>
<li>size</li>
<li>ndim</li>
<li>T</li>

</ul>

In [51]:
olympic_df.columns # this presents the list of all the columns of the dataframe

Index(['HostCity', 'Year', 'No. Of Participating Countries'], dtype='object')

In [52]:
olympic_df.dtypes  # this presents the datatypes of the values present in all the columns

HostCity                          object
Year                               int64
No. Of Participating Countries     int64
dtype: object

In [53]:
olympic_df.axes # this presents the indices of both the rows and columns

[RangeIndex(start=0, stop=6, step=1),
 Index(['HostCity', 'Year', 'No. Of Participating Countries'], dtype='object')]

In [54]:
olympic_df.shape # this presents the number of rows and columns as a tuple value

(6, 3)

In [55]:
olympic_df.size # this presents the total number of elements present in the dataframe

18

In [56]:
olympic_df.ndim # this presents the number of dimensions of the dataframe

2

In [57]:
olympic_df.T # this can be used to transpose the data

,0,1,2,3,4,5
HostCity,Tokyo,London,Beijing,Athens,Sydney,Atlanta
Year,2021,2012,2008,2004,2000,1996
No. Of Participating Countries,202,205,204,201,200,197

# Dataframe methods to explore the dataset

In [58]:
olympic_df.head() #by default, this retrieves the top 5 records of the dataframe

  HostCity  Year  No. Of Participating Countries
0    Tokyo  2021                             202
1   London  2012                             205
2  Beijing  2008                             204
3   Athens  2004                             201
4   Sydney  2000                             200

In [59]:
olympic_df.tail() #by default, this retrieves the last 5 records of the dataframe

  HostCity  Year  No. Of Participating Countries
1   London  2012                             205
2  Beijing  2008                             204
3   Athens  2004                             201
4   Sydney  2000                             200
5  Atlanta  1996                             197

In [60]:
olympic_df.head(n=3)

  HostCity  Year  No. Of Participating Countries
0    Tokyo  2021                             202
1   London  2012                             205
2  Beijing  2008                             204

In [61]:
olympic_df.tail(n=2)

  HostCity  Year  No. Of Participating Countries
4   Sydney  2000                             200
5  Atlanta  1996                             197

In [66]:
olympic_df.describe()# this gives the statistical summary of your dataframe 
#by default, this will describe only the numerical columns

              Year  No. Of Participating Countries
count     6.000000                        6.000000
mean   2006.833333                      201.500000
std       8.953584                        2.880972
min    1996.000000                      197.000000
25%    2001.000000                      200.250000
50%    2006.000000                      201.500000
75%    2011.000000                      203.500000
max    2021.000000                      205.000000

In [63]:
olympic_df.describe(include="all")

       HostCity         Year  No. Of Participating Countries
count         6     6.000000                        6.000000
unique        6          NaN                             NaN
top      Sydney          NaN                             NaN
freq          1          NaN                             NaN
mean        NaN  2006.833333                      201.500000
std         NaN     8.953584                        2.880972
min         NaN  1996.000000                      197.000000
25%         NaN  2001.000000                      200.250000
50%         NaN  2006.000000                      201.500000
75%         NaN  2011.000000                      203.500000
max         NaN  2021.000000                      205.000000

In [64]:
olympic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
HostCity                          6 non-null object
Year                              6 non-null int64
No. Of Participating Countries    6 non-null int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

How to apply a function on a dataframe 

-- applymap

-- apply

In [67]:
df_movie = pd.DataFrame({"movie_1":[5,4,3,5,1],"movie_2":[2,3,4,5,1]},index=["Tom","Jeff","Peter","Ram","Paul"])

In [68]:
df_movie

       movie_1  movie_2
Tom          5        2
Jeff         4        3
Peter        3        4
Ram          5        5
Paul         1        1

In [69]:
# we are defining a function to assign corresponding grades for the ratings
def movie_grade(rating):
    if rating == 5:
        return "A"
    if rating == 4:
        return "B"
    if rating == 3:
        return "C"
    else:
        return "F"

In [73]:
# let's quickly test the function for it's functionality

movie_grade(3) # function call

'C'

# Control Structures in Python

In [71]:
movie_rating = 4

if movie_rating == 5:
    print("This movie is very good to watch")
else:
    print("The movie is average")

The movie is average

In [72]:
movie_rating = 5

if movie_rating == 5:
    print("This movie is very good to watch")
else:
    print("The movie is average")

This movie is very good to watch

# Now let us see how we can apply this function on our dataframe

In [74]:
df_movie.applymap(movie_grade) # applymap is the method that should be used to apply functions on a dataframe

      movie_1 movie_2
Tom         A       F
Jeff        B       C
Peter       C       B
Ram         A       A
Paul        F       F

we can infer from above that the function - movie_grade has been applied on the entire dataframe

In [75]:
df_movie['movie_1'].apply(movie_grade) # we can use the apply method to apply the function only on specific columns

Tom      A
Jeff     B
Peter    C
Ram      A
Paul     F
Name: movie_1, dtype: object

we can infer from above that if we want to apply the function to a specific column, then we should be using the apply() methhod instead of the applymap() method.

In [76]:
df_movie

       movie_1  movie_2
Tom          5        2
Jeff         4        3
Peter        3        4
Ram          5        5
Paul         1        1

In [77]:
df_movie.max() # this retrieves the max values of all the numerical columns of the dataframe

movie_1    5
movie_2    5
dtype: int64

In [78]:
df_movie["movie_1"].max() # this is how you use the max() function on a particular column

5

In [79]:
df_movie.min() # this retrieves the minimum values of all the numerical columns of the dataframe

movie_1    1
movie_2    1
dtype: int64

In [81]:
df_movie["movie_2"].min() # this is how you use the min() function on a particular column

1

In [82]:
df_movie.mean() # this computes the average values of all the numerical columns present in the dataframe

movie_1    3.6
movie_2    3.0
dtype: float64

In [83]:
df_movie["movie_2"].mean() #this would compute the average value of the selected column alone

3.0

In [84]:
df_movie.std() # this computes the standard deviation values of all the numerical columns present in the dataframe

movie_1    1.673320
movie_2    1.581139
dtype: float64

In [85]:
df_movie["movie_1"].std() #this would compute the standard deviation value of the selected column alone

1.6733200530681511

In [91]:
df_movie["movie_1"].idxmax() # this would give the label of the maximum value of the selected column

'Tom'

also note that , idxmax() returns only the label of the first instance of the max value

In [90]:
df_movie["movie_2"].idxmax()

'Ram'

In [92]:
df_movie["movie_1"].idxmin()  # this would give the label of the minimum value of the selected column

'Paul'

In [96]:
df_movie["movie_1"].values # the values attribute, when used on a particular column of a dataframe 
#would convert it to a numpy array

array([5, 4, 3, 5, 1], dtype=int64)

In [97]:
df_movie["movie_1"].values.argmax() # after converting the series column to a numpy array, argmax() is 
#returning the index position of the first instance of the maximum value pesent in the selected column

0

In [98]:
df_movie["movie_1"].values.argmin() # after converting the series column to a numpy array, argmax() is 
#returning the index position of the first instance of the minimum value pesent in the selected column

4

# How to export a dataframe to a csv file

In [108]:
df_movie.to_csv("movie_ratings.csv") # always specify the file extension

In [100]:
df_movie.to_csv("movie_ratings2") # this is wrong , becasue the file extension has not been provided

In [118]:
df_movie.to_csv("D:\SimpliLearn\Data_Science\movie_ratings.csv")

How to export a csv file without row labels

In [103]:
df_movie.to_csv("movie_ratings_without_row_label.csv" , index = False)

# How to import a csv file into the jupyter environment ?

In [109]:
movie_ratings_df = pd.read_csv("movie_ratings.csv")

In [110]:
movie_ratings_df

  Unnamed: 0  movie_1  movie_2
0        Tom        5        2
1       Jeff        4        3
2      Peter        3        4
3        Ram        5        5
4       Paul        1        1

**How to rename columns in a dataframe**

In [111]:
movie_ratings_df.rename(columns={'Unnamed: 0': 'Reviewer_Name'}, inplace=True)

# if you want the change in column name to reflect in your original dataframe , you should specify inplace = True

In [112]:
movie_ratings_df

  Reviewer_Name  movie_1  movie_2
0           Tom        5        2
1          Jeff        4        3
2         Peter        3        4
3           Ram        5        5
4          Paul        1        1

In [106]:
movie_ratings_df2 = pd.read_csv("movie_ratings_without_row_label.csv")

movie_ratings_df2

   movie_1  movie_2
0        5        2
1        4        3
2        3        4
3        5        5
4        1        1

**How to import only a particular set of columns from the dataset**

In [115]:
movie_ratings_df3 = pd.read_csv("movie_ratings.csv" , names=["movie_1","movie_2"] )

In [116]:
movie_ratings_df3

       movie_1  movie_2
NaN    movie_1  movie_2
Tom          5        2
Jeff         4        3
Peter        3        4
Ram          5        5
Paul         1        1

# How to get to know the file path in jupyter ?

In [120]:
import os 
#full path
dir_path = os.path.dirname(os.path.realpath("movie_ratings.csv"))

#current dir
cwd = os.getcwd()

In [121]:
print(dir_path)

D:\Untitled Folder 1

In [122]:
print(cwd)

D:\Untitled Folder 1

# How to combine dataframes ?

In [123]:
#Define a dictionary containing Student data 

data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Chennai'], 
        } 
   
#Define a dictionary containing Student data 
data2 = {'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
        'Age':[17, 14, 12, 52], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Chennai'], 
        }

In [124]:
# Convert dict to df

data1_df = pd.DataFrame(data1 , index=[0,1,2,3])
data2_df = pd.DataFrame(data2 , index=[5,6,7,8])

In [125]:
data1_df

     Name  Age    Address
0     Jai   27     Nagpur
1  Princi   24     Kanpur
2  Gaurav   22  Allahabad
3    Anuj   32    Chennai

In [126]:
data2_df

     Name  Age    Address
5    Abhi   17     Nagpur
6  Ayushi   14     Kanpur
7  Dhiraj   12  Allahabad
8  Hitesh   52    Chennai

# how to use the .concat() method?

In [128]:
df_name_list = [data1_df,data2_df]

concat_dfs = pd.concat(df_name_list)

print("The concatenated student data is :")
print(concat_dfs)

The concatenated student data is :
     Name  Age    Address
0     Jai   27     Nagpur
1  Princi   24     Kanpur
2  Gaurav   22  Allahabad
3    Anuj   32    Chennai
5    Abhi   17     Nagpur
6  Ayushi   14     Kanpur
7  Dhiraj   12  Allahabad
8  Hitesh   52    Chennai

# How to use the append function

In [135]:
append_dfs = data1_df.append(data2_df)

In [136]:
append_dfs

     Name  Age    Address
0     Jai   27     Nagpur
1  Princi   24     Kanpur
2  Gaurav   22  Allahabad
3    Anuj   32    Chennai
5    Abhi   17     Nagpur
6  Ayushi   14     Kanpur
7  Dhiraj   12  Allahabad
8  Hitesh   52    Chennai

# How to use the merge() method?

In [164]:
#Define a dictionary containing Student data 

data1 = {'Student_Id' :[101,102,103,104],
    'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Chennai'], 
        } 
   
#Define a dictionary containing Student data 
data2 = { 'Student_Id' :[103,104,107,108],
    'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
        'Age':[17, 14, 12, 52], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Chennai'], 
        }

In [165]:
student_df1 = pd.DataFrame(data1)
student_df2 = pd.DataFrame(data2)

In [166]:
student_df1

   Student_Id    Name  Age    Address
0         101     Jai   27     Nagpur
1         102  Princi   24     Kanpur
2         103  Gaurav   22  Allahabad
3         104    Anuj   32    Chennai

In [167]:
student_df2

   Student_Id    Name  Age    Address
0         103    Abhi   17     Nagpur
1         104  Ayushi   14     Kanpur
2         107  Dhiraj   12  Allahabad
3         108  Hitesh   52    Chennai

In [169]:
# using .merge() function
merged_dfs = pd.merge(student_df1, student_df2, on='Student_Id')
 
merged_dfs

   Student_Id  Name_x  Age_x  Address_x  Name_y  Age_y Address_y
0         103  Gaurav     22  Allahabad    Abhi     17    Nagpur
1         104    Anuj     32    Chennai  Ayushi     14    Kanpur

In [172]:
merged_dfs2 = pd.merge(student_df1, student_df2, on='Student_Id', how = "left")

merged_dfs2

   Student_Id  Name_x  Age_x  Address_x  Name_y  Age_y Address_y
0         101     Jai     27     Nagpur     NaN    NaN       NaN
1         102  Princi     24     Kanpur     NaN    NaN       NaN
2         103  Gaurav     22  Allahabad    Abhi   17.0    Nagpur
3         104    Anuj     32    Chennai  Ayushi   14.0    Kanpur

In [173]:
merged_dfs3 = pd.merge(student_df1, student_df2, on='Student_Id', how = "right")

merged_dfs3

   Student_Id  Name_x  Age_x  Address_x  Name_y  Age_y  Address_y
0         103  Gaurav   22.0  Allahabad    Abhi     17     Nagpur
1         104    Anuj   32.0    Chennai  Ayushi     14     Kanpur
2         107     NaN    NaN        NaN  Dhiraj     12  Allahabad
3         108     NaN    NaN        NaN  Hitesh     52    Chennai